app/Controllers/Branchlist.php

    public function index()

    {
        $session = \Config\Services::session();
        $roles = $this->session->get('login_role_id');
        $lastUpdateDate =$session->get('login_last_update_date');

         // Ensure DateTime is used from global namespace
         $lastUpdateDateTime = new \DateTime($lastUpdateDate);
         $expiryDate = clone $lastUpdateDateTime;
         $expiryDate->modify('+90 days');
         $today = new \DateTime();

         // Calculate the interval
         $interval = $today->diff($expiryDate);

         // Determine the number of days remaining
         $daysRemaining = $today > $expiryDate ? -$interval->days : $interval->days;

        // Get page access from the database using the query builder
        $builder = $this->db->table('tbl_roles_permission');
        $query = $builder->getWhere([
            'page_name' => '3s_branchlist',
            'role_id' => $roles
        ]);
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = '3s_branchlist'
AND `role_id` = '1'