app/Controllers/Location.php

SELECT DISTINCT `area`
FROM `tbl_location`
WHERE `is_active` = 1
---
     public function getAreas()
{
    // Load the model for categories
    $locationModel = new \App\Models\Location_model();

    // Fetch distinct categories where is_active = 1
    $builder = $locationModel->builder();
    $builder->distinct(); // Correctly use DISTINCT in the SQL
    $builder->select('area'); // Correctly use DISTINCT in the SQL
    $builder->where('is_active', 1); // Filter by is_active
    $areas = $builder->get()->getResultArray();