app/Controllers/LoginController.php

    public function index()
    {
        $data = [];
        $data['page_title'] = "Login";
        $session = session();

        if ($this->request->getMethod() == 'post') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
            $user = $this->loginModel->where('username', $username)->first();

            if ($user) {
                if ($user['is_active'] == 1) {
                    $verify_password = password_verify($password, $user['password']);
                    if ($verify_password) {
                        // Update the last login date
                        $this->loginModel->update($user['id'], ['last_login_date' => date('Y-m-d H:i:s')]);
---
UPDATE `users` SET `last_login_date` = '2024-08-18 13:33:41'
WHERE `users`.`id` IN ('00001')