app/Controllers/Motorcyclelist.php

    public function edit($id)
    {
        $data = $this->motorcyclelist_model->find($id);
---
SELECT *
FROM `tbl_motorcyclelist`
WHERE `tbl_motorcyclelist`.`id` = '00002'

                return $this->response->setJSON(['success' => false, 'error' => 'Record with the same details already exists.']);
            }

            $this->motorcyclelist_model->update($id, $userData);
---
UPDATE `tbl_motorcyclelist` SET `pet_name` = 'TEQ', `model_code` = 'TEQ', `model_name` = 'TEQDGF', `model_type` = 'HYPER NAKED', `category` = 'SPORTS MACHINE', `updated_at` = '2024-08-18 13:20:47', `updated_by` = 'Rosly Rapada'
WHERE `tbl_motorcyclelist`.`id` IN ('00002')