app/Controllers/Motorcyclecategory.php

    public function edit($id)
    {
        $data = $this->motorcyclecategory_model->find($id);
---
SELECT *
FROM `tbl_motorcycle_category`
WHERE `tbl_motorcycle_category`.`id` = '00000000002'

    public function getData()
    {
        $datas = $this->motorcyclecategory_model->findAll();
---
SELECT *
FROM `tbl_motorcycle_category`