app/Controllers/Servicebulletins.php

    public function getData()
    {

        $datas = $this->servicebulletins_model->where('is_active', 1)->findAll();
---
SELECT *
FROM `tbl_service_bulletins`
WHERE `is_active` = 1