app/Models/Motorcyclelist_model.php

SELECT `tbl_motorcyclelist`.*, `tbl_motorcycle_category`.`model_type` as `modeltype`
FROM `tbl_motorcyclelist`
LEFT JOIN `tbl_motorcycle_category` ON `tbl_motorcyclelist`.`model_type` = `tbl_motorcycle_category`.`id`
---
    public function getDataWithModelType()
{
    // Build the query
    $builder = $this->builder();

    // Select the necessary columns
    $builder->select('tbl_motorcyclelist.IndexKey, tbl_motorcyclelist.is_active, tbl_motorcyclelist.pet_name, tbl_motorcyclelist.model_code, tbl_motorcyclelist.model_name, tbl_motorcyclelist.created_by, tbl_motorcyclelist.created_at, tbl_motorcyclelist.updated_by, tbl_motorcyclelist.updated_at, tbl_motorcycle_category.model_type, tbl_motorcycle_category.category');

    // Join with the motorcycle category table
    $builder->join('tbl_motorcycle_category', 'tbl_motorcyclelist.category_id = tbl_motorcycle_category.IndexKey', 'left');

    // Add condition to fetch only records where is_active = 1
    $builder->where('tbl_motorcyclelist.is_active', 1);

    // Execute the query
    $query = $builder->get();