app/Models/Servicemanuals_model.php

    public function countCurrentMonthYear()
    {
        return $this->where('YEAR(created_at)', date('Y'))
                    ->where('MONTH(created_at)', date('m'))
                    ->where('is_active', 1)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_service_manuals`
WHERE YEAR(created_at) = '2024'
AND MONTH(created_at) = '10'
AND `is_active` = 1