app/Views/layouts/add_script.php

$role_name = $user_roles; // Ensure this is the correct role

// Query the permissions for the Motorcycle_list page and the user's role
$query_motorcyclelist = $db->table('tbl_roles_permission')
    ->where('page_name', 'Motorcycle_list')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Motorcycle_list'
AND `role_id` = '1'

}

// Query the permissions for the 3s_branchlist page and the user's role
$query_3s_branchlist = $db->table('tbl_roles_permission')
    ->where('page_name', '3s_branchlist')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = '3s_branchlist'
AND `role_id` = '1'

}

// Query the permissions for the Service_manual page and the user's role
$query_Service_manual = $db->table('tbl_roles_permission')
    ->where('page_name', 'Service_manual')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Service_manual'
AND `role_id` = '1'

}

// Query the permissions for the Service_bulletin page and the user's role
$query_Service_bulletin = $db->table('tbl_roles_permission')
    ->where('page_name', 'Service_bulletin')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Service_bulletin'
AND `role_id` = '1'

}

// Query the permissions for the Motorcycle_category page and the user's role
$query_Motorcycle_category = $db->table('tbl_roles_permission')
    ->where('page_name', 'Motorcycle_category')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Motorcycle_category'
AND `role_id` = '1'



// Query the permissions for the Location page and the user's role
$query_Location = $db->table('tbl_roles_permission')
    ->where('page_name', 'Location')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Location'
AND `role_id` = '1'



// Query the permissions for the Location page and the user's role   Roles_permission
$query_Users = $db->table('tbl_roles_permission')
    ->where('page_name', 'Users')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Users'
AND `role_id` = '1'

}

// Query the permissions for the  Roles_permission page and the user's role
$query_Roles_permission = $db->table('tbl_roles_permission')
    ->where('page_name', 'Roles_permission')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Roles_permission'
AND `role_id` = '1'



// Query the permissions for the  Roles_permission page and the user's role
$query_Profile = $db->table('tbl_roles_permission')
    ->where('page_name', 'Profile')
    ->where('role_id', $role_name)
    ->get();
---
SELECT *
FROM `tbl_roles_permission`
WHERE `page_name` = 'Profile'
AND `role_id` = '1'

//profile info

// Query the permissions for the Roles_permission page and the user's role
$query_user_info = $db->table('users')
    ->select('tbl_roles.roles, tbl_3sbranch_list.head_office, tbl_3sbranch_list.dealer_name, tbl_location.area')
    ->join('tbl_roles', 'users.role_id = tbl_roles.IndexKey')
    ->join('tbl_3sbranch_list', 'users.branch_id = tbl_3sbranch_list.IndexKey')
    ->join('tbl_location', 'tbl_3sbranch_list.location_id = tbl_location.IndexKey')
    ->where('users.role_id', $role_name)  // Assuming $role_name is already defined
    ->get();
---
SELECT `tbl_roles`.`roles`, `tbl_3sbranch_list`.`head_office`, `tbl_3sbranch_list`.`dealer_name`, `tbl_location`.`area`
FROM `users`
JOIN `tbl_roles` ON `users`.`role_id` = `tbl_roles`.`IndexKey`
JOIN `tbl_3sbranch_list` ON `users`.`branch_id` = `tbl_3sbranch_list`.`IndexKey`
JOIN `tbl_location` ON `tbl_3sbranch_list`.`location_id` = `tbl_location`.`IndexKey`
WHERE `users`.`role_id` = '1'

//service bulletins

// Query the permissions for the Roles_permission page and the user's role
$query_bulletins = $db->table('tbl_service_bulletins')
    ->select('title, reference_number, date_published')
    ->where('MONTH(created_at) = MONTH(NOW())')  // Filter for current month
    ->where('YEAR(created_at) = YEAR(NOW())')    // Filter for current year
    ->where('is_active', 1)
    ->get();
---
SELECT `title`, `reference_number`, `date_published`
FROM `tbl_service_bulletins`
WHERE MONTH(created_at) = MONTH(NOW())
AND YEAR(created_at) = YEAR(NOW())
AND `is_active` = 1


//service bulletins
// Query the service manuals and join with motorcycle list
$query_manual = $db->table('tbl_service_manuals')
    ->select('tbl_motorcyclelist.model_name, tbl_motorcyclelist.model_code, tbl_service_manuals.year_published')
    ->join('tbl_motorcyclelist', 'tbl_service_manuals.motorcycle_id = tbl_motorcyclelist.IndexKey', 'left')
    ->where('MONTH(tbl_service_manuals.created_at)', date('n')) // Filter for current month
    ->where('YEAR(tbl_service_manuals.created_at)', date('Y'))  // Filter for current year
    ->where('tbl_service_manuals.is_active', 1)
    ->get();
---
SELECT `tbl_motorcyclelist`.`model_name`, `tbl_motorcyclelist`.`model_code`, `tbl_service_manuals`.`year_published`
FROM `tbl_service_manuals`
LEFT JOIN `tbl_motorcyclelist` ON `tbl_service_manuals`.`motorcycle_id` = `tbl_motorcyclelist`.`IndexKey`
WHERE MONTH(tbl_service_manuals.created_at) = '10'
AND YEAR(tbl_service_manuals.created_at) = '2024'
AND `tbl_service_manuals`.`is_active` = 1